src/advanced/backend/views/report/_detail.php

SELECT * FROM `user` WHERE 0=1
---
            ],
            [
              'label'=>'Approved by',
              'value'=>$model->getApprovedUser()->one()==null?"-":$model->getApprovedUser()->one()->name,