src/advanced/backend/views/report/view.php

            ],
        ]) ?>

      <?php if(Yii::$app->user->can('mark-report-approval') &&
       $model->getApprovedUser()->one()==null)
---
SELECT * FROM `user` WHERE `id`=7