src/advanced/backend/views/project/_detail.php

/* @var $model backend\models\Report */
/* @var $form yii\widgets\ActiveForm */
  $members = "";
  if($model->getUsers()->all())
---
SELECT * FROM `user` WHERE 0=1

            // 'parent_project_id',
            [
              'attribute'=>'parent_project_id',
              'value'=>$model->getParentProject()->one()==null?"-":$model->getParentProject()->one()->name,
---
SELECT * FROM `project` WHERE 0=1

              'value'=>$model->getApprovedDhUser()->one()==null?"-":$model->getApprovedDhUser()->one()->name,
            ],

            [
              'attribute'=>'approved_ddg_user_id',
              'value'=>$model->getApprovedDdgUser()->one()==null?"-":$model->getApprovedDdgUser()->one()->name,
            ],
---
SELECT * FROM `user` WHERE 0=1