src/advanced/backend/views/project/printview.php

SELECT * FROM `report` WHERE `project_id`=4
---
{

    echo "<br/><h3>Attached reports.</h3>";
     $reports = $model->getReports()->all();