src/advanced/backend/views/project/view.php

        </button>
        <ul class="dropdown-menu" aria-labelledby="dropdownMenu1">
          <?php
            $reportTemplates =ReportTemplate::find()->all();
---
SELECT * FROM `report_template`

                'method' => 'post',
            ],
        ]) ?>
        <?php if(Yii::$app->user->can('mark-dh-approval') && $model->getApprovedDhUser()->one()==null) echo Html::a('Approve by DH', ['approvedh', 'id' => $model->id], ['class' => 'btn btn-primary']); ?>
        <?php if(Yii::$app->user->can('mark-ddg-approval') && $model->getApprovedDdgUser()->one()==null) echo Html::a('Approve by DDG', ['approveddg', 'id' => $model->id], ['class' => 'btn btn-primary']); ?>
---
SELECT * FROM `user` WHERE `id`=7

    <div>
    <?php
      //Generate tab view of reports
      $reports = $model->getReports()->all();
---
SELECT * FROM `report` WHERE `project_id`=4