src/advanced/common/models/User.php

SELECT * FROM `user` WHERE (`email`='allaccess') AND (`status`=10)
SELECT * FROM `user` WHERE (`username`='allaccess') AND (`status`=10)
---
    public static function findByUsername($username)
    {
        $user =  static::findOne(['email' => $username, 'status' => self::STATUS_ACTIVE]);
        if(!$user) $user = static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);