src/models/User.php

SELECT * FROM `user` WHERE `username`='admin'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);