src/advanced/backend/controllers/ProjectController.php

    protected function findModel($id)
    {
        if (($model = Project::findOne($id)) !== null) {
---
SELECT * FROM `project` WHERE `id`='4'