src/advanced/backend/controllers/ReportController.php

SELECT * FROM `report` WHERE `id`='6'
---
    protected function findModel($id)
    {
        if (($model = Report::findOne($id)) !== null) {