src/advanced/backend/controllers/UserController.php

SELECT * FROM `auth_assignment` WHERE `user_id`='3'
---
    public function actionView($id)
    {
        $query = User::FindOne($id)->getDivisions();
        $dataProvider = new ActiveDataProvider([
            'query' => $query,
        ]);

        $authsQ = User::FindOne($id)->getAuthAssignments();